{
  "architectures": [
    "DebertaV2ForTokenClassification"
  ],
  "attention_probs_dropout_prob": 0.1,
  "bos_token_id": 1,
  "dtype": "float32",
  "eos_token_id": 2,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 768,
  "id2label": {
    "0": "O",
    "1": "B-NAME_STUDENT",
    "2": "I-NAME_STUDENT",
    "3": "B-EMAIL",
    "4": "I-EMAIL",
    "5": "B-USERNAME",
    "6": "I-USERNAME",
    "7": "B-ID_NUM",
    "8": "I-ID_NUM",
    "9": "B-PHONE_NUM",
    "10": "I-PHONE_NUM",
    "11": "B-URL_PERSONAL",
    "12": "I-URL_PERSONAL",
    "13": "B-STREET_ADDRESS",
    "14": "I-STREET_ADDRESS"
  },
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "label2id": {
    "B-EMAIL": 3,
    "B-ID_NUM": 7,
    "B-NAME_STUDENT": 1,
    "B-PHONE_NUM": 9,
    "B-STREET_ADDRESS": 13,
    "B-URL_PERSONAL": 11,
    "B-USERNAME": 5,
    "I-EMAIL": 4,
    "I-ID_NUM": 8,
    "I-NAME_STUDENT": 2,
    "I-PHONE_NUM": 10,
    "I-STREET_ADDRESS": 14,
    "I-URL_PERSONAL": 12,
    "I-USERNAME": 6,
    "O": 0
  },
  "layer_norm_eps": 1e-07,
  "legacy": true,
  "max_position_embeddings": 512,
  "max_relative_positions": -1,
  "model_type": "deberta-v2",
  "norm_rel_ebd": "layer_norm",
  "num_attention_heads": 12,
  "num_hidden_layers": 12,
  "pad_token_id": 0,
  "pooler_dropout": 0,
  "pooler_hidden_act": "gelu",
  "pooler_hidden_size": 768,
  "pos_att_type": [
    "p2c",
    "c2p"
  ],
  "position_biased_input": false,
  "position_buckets": 256,
  "relative_attention": true,
  "share_att_key": true,
  "transformers_version": "4.57.1",
  "type_vocab_size": 0,
  "vocab_size": 128100
}
